# 1. Задание с использованием цикла for:

# numbers = [54, 56, 32, 75, 46]

# for i in numbers:
#     print(i)


# Задание с использованием цикла while:

# names = ['Adham', 'Sardor', 'Soliha', 'Sarvinoz', 'Abror']
# i = 0

# while i < 1:
#     for j in names:
#         print(j)
#     i += 1


# Задание на суммирование элементов списка с использованием цикла for:

# second_numbers = [54, 56, 32, 75, 46]
# count = 0

# for i in second_numbers:
#     count += i
# print(count)


# Задание на поиск элемента с использованием цикла while:

# second_numbers = [87, 45, 54, 56, 32, 75, 46]

# while True:
#     for i in second_numbers:
#         if i % 2 == 0:
#             print(i)
#             break
#     break
    
# Задание на удаление элементов списка с использованием цикла for:

# second_numbers = [87, 45, 54, 56, 32, 75, 46]

# for i in second_numbers:
#     if i < 5:
#         second_numbers.remove(i)

# print(second_numbers)


# Задание на добавление элементов в список с использованием цикла while:

# my_list = []
# i = True

# while i == True:
#     ask_number = int(input("son kiriting: "))
#     if ask_number != 0:
#         my_list.append(ask_number)
#     elif ask_number == 0:
#         i = False


# Задание на индексацию элементов списка с использованием цикла for:

# own_list = ['dfgsf', 23, 43.34, True, [3,5,6],]
# own_index = 0

# for i in own_list:
#     print(f"index {own_index} : element {i}")
#     own_index += 1